<?php

return [
    'label' => 'Зона доставки',
    'label_plural' => 'Зони доставки',
    'form' => [
        'unrestricted' => [
            'content' => 'Ця зона доставки не має обмежень і буде доступна всім клієнтам під час оформлення.',
        ],
        'name' => [
            'label' => 'Назва',
        ],
        'type' => [
            'label' => 'Тип',
            'options' => [
                'unrestricted' => 'Без обмежень',
                'countries' => 'Обмежити країнами',
                'states' => 'Обмежити областями/провінціями',
                'postcodes' => 'Обмежити поштовими індексами',
            ],
        ],
        'country' => [
            'label' => 'Країна',
        ],
        'states' => [
            'label' => 'Області',
        ],
        'countries' => [
            'label' => 'Країни',
        ],
        'postcodes' => [
            'label' => 'Поштові індекси',
            'helper' => 'Вказуйте кожен індекс з нового рядка. Підтримуються шаблони, наприклад NW*',
        ],
    ],
    'table' => [
        'name' => [
            'label' => 'Назва',
        ],
        'type' => [
            'label' => 'Тип',
            'options' => [
                'unrestricted' => 'Без обмежень',
                'countries' => 'Обмежити країнами',
                'states' => 'Обмежити областями/провінціями',
                'postcodes' => 'Обмежити поштовими індексами',
            ],
        ],
    ],
];
