<?php

return [
    'collections' => [
        'create_root' => [
            'label' => 'Створити кореневу колекцію',
        ],
        'create_child' => [
            'label' => 'Створити дочірню колекцію',
        ],
        'move' => [
            'label' => 'Перемістити колекцію',
        ],
        'delete' => [
            'label' => 'Видалити',
            'notifications' => [
                'cannot_delete' => [
                    'title' => 'Неможливо видалити',
                    'body' => 'Ця колекція має дочірні колекції й не може бути видалена.',
                ],
            ],
        ],
    ],
    'orders' => [
        'update_status' => [
            'label' => 'Оновити статус',
            'wizard' => [
                'step_one' => [
                    'label' => 'Статус',
                ],
                'step_two' => [
                    'label' => 'Поштові шаблони та сповіщення',
                    'no_mailers' => 'Для цього статусу немає доступних поштових шаблонів.',
                ],
                'step_three' => [
                    'label' => 'Попередній перегляд і збереження',
                    'no_mailers' => 'Для попереднього перегляду не вибрано жодного поштового шаблону.',
                ],
            ],
            'notification' => [
                'label' => 'Статус замовлення оновлено',
            ],
            'billing_email' => [
                'label' => 'Email для рахунку',
            ],
            'shipping_email' => [
                'label' => 'Email для доставки',
            ],
        ],

    ],
];
