<?php

return [
    'customer_groups' => [
        'title' => 'Групи клієнтів',
        'actions' => [
            'attach' => [
                'label' => 'Прив’язати групу клієнтів',
            ],
        ],
        'form' => [
            'name' => [
                'label' => 'Назва',
            ],
            'enabled' => [
                'label' => 'Увімкнено',
            ],
            'starts_at' => [
                'label' => 'Дата початку',
            ],
            'ends_at' => [
                'label' => 'Дата завершення',
            ],
            'visible' => [
                'label' => 'Видимий',
            ],
            'purchasable' => [
                'label' => 'Доступний для купівлі',
            ],
        ],
        'table' => [
            'description' => 'Прив’яжіть групи клієнтів до цього :type, щоб визначити його доступність.',
            'name' => [
                'label' => 'Назва',
            ],
            'enabled' => [
                'label' => 'Увімкнено',
            ],
            'starts_at' => [
                'label' => 'Дата початку',
            ],
            'ends_at' => [
                'label' => 'Дата завершення',
            ],
            'visible' => [
                'label' => 'Видимий',
            ],
            'purchasable' => [
                'label' => 'Доступний для купівлі',
            ],
        ],
    ],
    'channels' => [
        'title' => 'Канали',
        'actions' => [
            'attach' => [
                'label' => 'Запланувати інший канал',
            ],
        ],
        'form' => [
            'enabled' => [
                'label' => 'Увімкнено',
                'helper_text_false' => 'Цей канал не буде увімкнено, навіть якщо вказано дату початку.',
            ],
            'starts_at' => [
                'label' => 'Дата початку',
                'helper_text' => 'Залиште порожнім, щоб бути доступним із будь-якої дати.',
            ],
            'ends_at' => [
                'label' => 'Дата завершення',
                'helper_text' => 'Залиште порожнім, щоб бути доступним безстроково.',
            ],
        ],
        'table' => [
            'description' => 'Визначте, які канали увімкнені, і заплануйте доступність.',
            'name' => [
                'label' => 'Назва',
            ],
            'enabled' => [
                'label' => 'Увімкнено',
            ],
            'starts_at' => [
                'label' => 'Дата початку',
            ],
            'ends_at' => [
                'label' => 'Дата завершення',
            ],
        ],
    ],
    'medias' => [
        'title' => 'Медіа',
        'title_plural' => 'Медіа',
        'actions' => [
            'attach' => [
                'label' => 'Додати медіа',
            ],
            'create' => [
                'label' => 'Створити медіа',
            ],
            'detach' => [
                'label' => 'Від’єднати',
            ],
            'view' => [
                'label' => 'Перегляд',
            ],
        ],
        'form' => [
            'name' => [
                'label' => 'Назва',
            ],
            'media' => [
                'label' => 'Зображення',
            ],
            'primary' => [
                'label' => 'Основне',
            ],
        ],
        'table' => [
            'image' => [
                'label' => 'Зображення',
            ],
            'file' => [
                'label' => 'Файл',
            ],
            'name' => [
                'label' => 'Назва',
            ],
            'primary' => [
                'label' => 'Основне',
            ],
        ],
        'all_media_attached' => 'Немає доступних зображень товару для прикріплення',
        'variant_description' => 'Прикріпіть зображення товару до цього варіанта',
    ],
    'urls' => [
        'title' => 'URL',
        'title_plural' => 'URL-адреси',
        'actions' => [
            'create' => [
                'label' => 'Створити URL',
            ],
        ],
        'filters' => [
            'language_id' => [
                'label' => 'Мова',
            ],
        ],
        'form' => [
            'slug' => [
                'label' => 'Слаг',
            ],
            'default' => [
                'label' => 'За замовчуванням',
            ],
            'language' => [
                'label' => 'Мова',
            ],
        ],
        'table' => [
            'slug' => [
                'label' => 'Слаг',
            ],
            'default' => [
                'label' => 'За замовчуванням',
            ],
            'language' => [
                'label' => 'Мова',
            ],
        ],
    ],
    'customer_group_pricing' => [
        'title' => 'Ціни для груп клієнтів',
        'title_plural' => 'Ціни для груп клієнтів',
        'table' => [
            'heading' => 'Ціни для груп клієнтів',
            'description' => 'Прив’яжіть ціну до груп клієнтів, щоб визначити ціну товару.',
            'empty_state' => [
                'label' => 'Немає цін для груп клієнтів.',
                'description' => 'Створіть ціну для групи клієнтів, щоб почати.',
            ],
            'actions' => [
                'create' => [
                    'label' => 'Додати ціну для групи клієнтів',
                    'modal' => [
                        'heading' => 'Створити ціну для групи клієнтів',
                    ],
                ],
            ],
        ],
    ],
    'pricing' => [
        'title' => 'Ціни',
        'title_plural' => 'Ціни',
        'tab_name' => 'Рівні цін',
        'table' => [
            'heading' => 'Рівні цін',
            'description' => 'Зменшуйте ціну, коли клієнт купує більші обсяги.',
            'empty_state' => [
                'label' => 'Немає рівнів цін.',
            ],
            'actions' => [
                'create' => [
                    'label' => 'Додати рівень ціни',
                ],
            ],
            'price' => [
                'label' => 'Ціна',
            ],
            'customer_group' => [
                'label' => 'Група клієнтів',
                'placeholder' => 'Усі групи клієнтів',
            ],
            'min_quantity' => [
                'label' => 'Мінімальна кількість',
            ],
            'currency' => [
                'label' => 'Валюта',
            ],
        ],
        'form' => [
            'price' => [
                'label' => 'Ціна',
                'helper_text' => 'Ціна продажу до застосування знижок.',
            ],
            'customer_group_id' => [
                'label' => 'Група клієнтів',
                'placeholder' => 'Усі групи клієнтів',
                'helper_text' => 'Виберіть, до якої групи клієнтів застосувати цю ціну.',
            ],
            'min_quantity' => [
                'label' => 'Мінімальна кількість',
                'helper_text' => 'Виберіть мінімальну кількість, для якої буде доступна ця ціна.',
                'validation' => [
                    'unique' => 'Група клієнтів і мінімальна кількість мають бути унікальними.',
                ],
            ],
            'currency_id' => [
                'label' => 'Валюта',
                'helper_text' => 'Виберіть валюту для цієї ціни.',
            ],
            'compare_price' => [
                'label' => 'Порівняльна ціна',
                'helper_text' => 'Початкова ціна або РРЦ для порівняння з ціною продажу.',
            ],
            'basePrices' => [
                'title' => 'Ціни',
                'form' => [
                    'price' => [
                        'label' => 'Ціна',
                        'helper_text' => 'Ціна продажу до застосування знижок.',
                        'sync_price' => 'Ціна синхронізується з валютою за замовчуванням.',
                    ],
                    'compare_price' => [
                        'label' => 'Порівняльна ціна',
                        'helper_text' => 'Початкова ціна або РРЦ для порівняння з ціною продажу.',
                    ],
                ],
                'tooltip' => 'Автоматично згенеровано на основі курсів обміну валют.',
            ],
        ],
    ],
    'tax_rate_amounts' => [
        'table' => [
            'description' => '',
            'percentage' => [
                'label' => 'Відсоток',
            ],
            'tax_class' => [
                'label' => 'Клас податку',
            ],
        ],
    ],
    'values' => [
        'title' => 'Значення',
        'form' => [
            'name' => [
                'label' => 'Назва',
            ],
        ],
        'table' => [
            'name' => [
                'label' => 'Назва',
            ],
            'position' => [
                'label' => 'Позиція',
            ],
        ],
    ],

];
