<?php

return [

    'label' => 'Клас податку',

    'plural_label' => 'Класи податку',

    'table' => [
        'name' => [
            'label' => 'Назва',
        ],
        'default' => [
            'label' => 'За замовчуванням',
        ],
    ],

    'form' => [
        'name' => [
            'label' => 'Назва',
        ],
        'default' => [
            'label' => 'За замовчуванням',
        ],
    ],
    'delete' => [
        'error' => [
            'title' => 'Неможливо видалити клас податку',
            'body' => 'Цей клас податку має пов’язані варіанти товару й не може бути видалений.',
        ],
    ],
];
