<?php

return [

    'label' => 'Експортувати :label',

    'modal' => [

        'heading' => 'Експортувати :label',

        'form' => [

            'columns' => [

                'label' => 'Колонки',

                'form' => [

                    'is_enabled' => [
                        'label' => ':column увімкнено',
                    ],

                    'label' => [
                        'label' => 'Мітка :column',
                    ],

                ],

            ],

        ],

        'actions' => [

            'export' => [
                'label' => 'Експортувати',
            ],

        ],

    ],

    'notifications' => [

        'completed' => [

            'title' => 'Експорт завершено',

            'actions' => [

                'download_csv' => [
                    'label' => 'Завантажити .csv',
                ],

                'download_xlsx' => [
                    'label' => 'Завантажити .xlsx',
                ],

            ],

        ],

        'max_rows' => [
            'title' => 'Експорт занадто великий',
            'body' => 'Не можна експортувати більше ніж 1 рядок за раз.|Не можна експортувати більше ніж :count рядків за раз.',
        ],

        'started' => [
            'title' => 'Експорт розпочато',
            'body' => 'Експорт розпочато, 1 рядок буде оброблено у фоні. Ви отримаєте сповіщення з посиланням на завантаження після завершення.|Експорт розпочато, :count рядків буде оброблено у фоні. Ви отримаєте сповіщення з посиланням на завантаження після завершення.',
        ],

    ],

    'file_name' => 'export-:export_id-:model',

];
